# PenSize

## Description
Procedure PenSize sets the active line weight for the document.

```pascal
PROCEDURE PenSize(lw : INTEGER);
```

```python
def vs.PenSize(lw):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|lw|INTEGER|Line weight (in mils). Fourteen (14) mils equals one pixel.|

## Examples
==== VectorScript ====
```pascal
PenSize(28);
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* Document Attributes